Catalogs/упСостоянияОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСостоянияОборудования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыСостоянийОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упТипыСостоянийОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыСостоянийОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованоНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыДополнительногоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыДополнительногоОборудования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СостояниеНеИспользуетсяПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОприходованоНаСкладПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеУстановленоНаТСПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСписаноПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упТипыШинУзловИАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыШинУзловИАгрегатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МодельТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СезонностьРезины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСезонностьРезины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмерятьНормуВМотоЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксироватьСрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭксплуатационнаяНормаКм</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭксплуатационнаяНормаМотоЧасы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеНеИспользуетсяПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОприходованоНаСкладПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеУстановленоНаТСПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСписаноПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упСостоянияОборудования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет первоначальное заполнение состояний оборудывания.
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Элемент = Справочники.упСостоянияОборудования.НеИспользуется.ПолучитьОбъект();
	Элемент.ТипСостояния = Перечисления.упТипыСостоянийОборудования.НеИспользуется;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияОборудования.ОприходованоНаСклад.ПолучитьОбъект();
	Элемент.ТипСостояния = Перечисления.упТипыСостоянийОборудования.ОприходованоНаСклад;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияОборудования.УстановленоНаТС.ПолучитьОбъект();
	Элемент.ТипСостояния = Перечисления.упТипыСостоянийОборудования.УстановленоНаТС;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияОборудования.Списано.ПолучитьОбъект();
	Элемент.ТипСостояния = Перечисления.упТипыСостоянийОборудования.Списано;
	Элемент.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПервоначальноеЗаполнение()

// Функция возвращает текущее Состояние типа оборудования
//
// Параметры:
//  Ссылка  - СправочникСсылка - Ссылка на элемент.
//
// Возвращаемое значение:
//   СправочникСсылка.упСостоянияОборудования - Результат выполнения.
//
Функция ПолучитьСостоянияПоУмолчанию(Ссылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СостояниеНеИспользуетсяПоУмолчанию", Справочники.упСостоянияОборудования.НеИспользуется);
	Результат.Вставить("СостояниеОприходованоНаСкладПоУмолчанию", Справочники.упСостоянияОборудования.ОприходованоНаСклад);
	Результат.Вставить("СостояниеУстановленоНаТСПоУмолчанию", Справочники.упСостоянияОборудования.УстановленоНаТС);
	Результат.Вставить("СостояниеСписаноПоУмолчанию", Справочники.упСостоянияОборудования.Списано);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	упДополнительноеОборудование.Ссылка КАК Ссылка,
	|	упТипыДополнительногоОборудования.СостояниеНеИспользуетсяПоУмолчанию КАК СостояниеНеИспользуетсяПоУмолчанию,
	|	упТипыДополнительногоОборудования.СостояниеОприходованоНаСкладПоУмолчанию КАК СостояниеОприходованоНаСкладПоУмолчанию,
	|	упТипыДополнительногоОборудования.СостояниеУстановленоНаТСПоУмолчанию КАК СостояниеУстановленоНаТСПоУмолчанию,
	|	упТипыДополнительногоОборудования.СостояниеСписаноПоУмолчанию КАК СостояниеСписаноПоУмолчанию
	|ИЗ
	|	Справочник.упДополнительноеОборудование КАК упДополнительноеОборудование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТипыДополнительногоОборудования КАК упТипыДополнительногоОборудования
	|		ПО упДополнительноеОборудование.ТипДополнительногоОборудования = упТипыДополнительногоОборудования.Ссылка
	|ГДЕ
	|	упТипыДополнительногоОборудования.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упШиныУзлыИАгрегаты.Ссылка,
	|	упТипыШинУзловИАгрегатов.СостояниеНеИспользуетсяПоУмолчанию,
	|	упТипыШинУзловИАгрегатов.СостояниеОприходованоНаСкладПоУмолчанию,
	|	упТипыШинУзловИАгрегатов.СостояниеУстановленоНаТСПоУмолчанию,
	|	упТипыШинУзловИАгрегатов.СостояниеСписаноПоУмолчанию
	|ИЗ
	|	Справочник.упШиныУзлыИАгрегаты КАК упШиныУзлыИАгрегаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТипыШинУзловИАгрегатов КАК упТипыШинУзловИАгрегатов
	|		ПО упШиныУзлыИАгрегаты.Тип = упТипыШинУзловИАгрегатов.Ссылка
	|ГДЕ
	|	упШиныУзлыИАгрегаты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если ЗначениеЗаполнено(Выборка.СостояниеНеИспользуетсяПоУмолчанию) Тогда
			Результат.Вставить("СостояниеНеИспользуетсяПоУмолчанию", Выборка.СостояниеНеИспользуетсяПоУмолчанию);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СостояниеОприходованоНаСкладПоУмолчанию) Тогда
			Результат.Вставить("СостояниеОприходованоНаСкладПоУмолчанию", Выборка.СостояниеОприходованоНаСкладПоУмолчанию);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СостояниеУстановленоНаТСПоУмолчанию) Тогда
			Результат.Вставить("СостояниеУстановленоНаТСПоУмолчанию", Выборка.СостояниеУстановленоНаТСПоУмолчанию);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СостояниеСписаноПоУмолчанию) Тогда
			Результат.Вставить("СостояниеСписаноПоУмолчанию", Выборка.СостояниеСписаноПоУмолчанию);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСостоянияПоУмолчанию()

#КонецОбласти

#КонецЕсли
